haywoodsloan/esp32-s3-eye-birdnet/main/app_main.c
/**
 * @file app_main.c
 * @brief ESP32-S3-EYE BirdNET firmware entry point (block pipeline + SD swap).
 *
 * Data flow:
 *
 *   [audio task]  mic --1024 samples--> 3 s ring buffer (+ live RMS level)
 *                        every 1.5 s of new audio --> signal infer
 *
 *   [infer task]  apply any requested model swap (SD -> PSRAM -> interpreter)
 *                 snapshot last 3 s --> STFT magnitude --> classifier
 *                 --> publish resolved species strings + display
 *
 *   [main loop]   snapshot shared state --> LVGL UI (spectrogram, species, model)
 *
 * Model selection (Option B): N expert DS-CNN models live on the microSD card;
 * one is resident in PSRAM at a time. A button press cycles to the next model.
 * If the SD/manifest is unavailable, the firmware falls back to the embedded
 * model (if BIRDNET_HAS_REAL_MODEL) or the mock classifier.
 */
#include <assert.h>
#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/stat.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"

#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_timer.h"

#include "bsp/esp32_s3_eye.h"
#include "iot_button.h"

#include "birdnet_config.h"
#include "audio_capture.h"
#include "stft_frontend.h"
#include "birdnet_model.h"
#include "model_registry.h"
#include "labels.h"
#include "ui.h"

#if BIRDNET_USE_PRIOR
#include "nvs_flash.h"
#include "occurrence_prior.h"
#include "birdnet_time.h"
#endif

#if BIRDNET_HAS_REAL_MODEL
#include "model_data.h"
#endif

static const char *TAG = "birdnet";

#define DISP_LEN (BIRDNET_DISP_H * BIRDNET_DISP_W)

/* ---- Shared state ------------------------------------------------------- */
static SemaphoreHandle_t s_ring_mutex;    /* guards ring buffer + write idx   */
static SemaphoreHandle_t s_infer_sem;     /* signals the inference task       */

static int16_t *s_ring;                   /* CHUNK_SAMPLES int16 ring buffer  */
static uint32_t s_ring_w = 0;             /* next write index (oldest sample) */
static volatile float s_level = 0.0f;     /* latest mic RMS [0,1]             */

/* Detection -> UI overlay handoff (inference task -> main render loop). The
 * inference task is also the sole writer of the labels table, so it captures
 * the species names + score here, then bumps s_det_seq LAST as the publish
 * signal. Detections are >= BIRDNET_INFER_INTERVAL_MS (1.5 s) apart, far longer
 * than a 16 ms UI frame, so the buffers are stable by the time the main loop
 * forwards them to the overlay. */
static volatile uint32_t s_det_seq = 0;
static char              s_det_name[64];
static char              s_det_sci[64];
static volatile float    s_det_score = 0.0f;

/* ---- Button: cycle to next model --------------------------------------- */
static button_handle_t s_btns[BSP_BUTTON_NUM];

static void on_button(void *arg, void *data)
{
    (void)arg; (void)data;
    model_registry_request_next();
}

static void setup_buttons(void)
{
    int n = 0;
    if (bsp_iot_button_create(s_btns, &n, BSP_BUTTON_NUM) != ESP_OK) {
        ESP_LOGW(TAG, "button init failed; model cycling via button disabled");
        return;
    }
    for (int i = 0; i < n; ++i) {
        iot_button_register_cb(s_btns[i], BUTTON_SINGLE_CLICK, NULL, on_button, NULL);
    }
    ESP_LOGI(TAG, "press any button to cycle models (%d buttons)", n);
}

/* ---- Audio capture task ------------------------------------------------- */
static void audio_task(void *arg)
{
    (void)arg;
    int16_t  read_buf[BIRDNET_READ_SAMPLES];
    uint32_t since_trigger = 0;

    ESP_LOGI(TAG, "audio task started");
    for (;;) {
        if (audio_capture_read(read_buf, BIRDNET_READ_SAMPLES) != ESP_OK) {
            vTaskDelay(pdMS_TO_TICKS(5));
            continue;
        }

        /* ESP32-S3 has a single-precision FPU only; double math is software-
         * emulated. The samples are normalized to [-1,1], so a float sum is
         * amply precise for level metering and far cheaper. */
        float sum_sq = 0.0f;
        for (int i = 0; i < BIRDNET_READ_SAMPLES; ++i) {
            float s = (float)read_buf[i] / 32768.0f;
            sum_sq += s * s;
        }
        s_level = sqrtf(sum_sq / (float)BIRDNET_READ_SAMPLES);

        xSemaphoreTake(s_ring_mutex, portMAX_DELAY);
        for (int i = 0; i < BIRDNET_READ_SAMPLES; ++i) {
            s_ring[s_ring_w] = read_buf[i];
            s_ring_w = (s_ring_w + 1) % BIRDNET_CHUNK_SAMPLES;
        }
        xSemaphoreGive(s_ring_mutex);

        /* Feed the smooth, continuously-scrolling display spectrogram. */
        stft_display_push(read_buf, BIRDNET_READ_SAMPLES);

        since_trigger += BIRDNET_READ_SAMPLES;
        if (since_trigger >= BIRDNET_INFER_INTERVAL_SAMPLES) {
            since_trigger = 0;
            xSemaphoreGive(s_infer_sem);
        }
    }
}

/* ---- Inference task ----------------------------------------------------- */
#if BIRDNET_RECORD_MODE || BIRDNET_LOG_AUDIO
/* Write a 44-byte canonical PCM WAV header for a known sample count. ESP32-S3 is
 * little-endian and WAV is little-endian, so the integer fields copy directly. */
static void wav_write_header(FILE *f, uint32_t num_samples)
{
    const uint32_t sr         = BIRDNET_SAMPLE_RATE_HZ;
    const uint16_t ch         = 1;
    const uint16_t bits       = 16;
    const uint16_t block_algn = (uint16_t)(ch * (bits / 8));
    const uint32_t byte_rate  = sr * block_algn;
    const uint32_t data_bytes = num_samples * block_algn;
    const uint32_t riff_size  = 36 + data_bytes;
    const uint32_t fmt_size   = 16;
    const uint16_t fmt_pcm    = 1;
    uint8_t h[44];
    memcpy(h + 0,  "RIFF", 4);   memcpy(h + 4,  &riff_size, 4);
    memcpy(h + 8,  "WAVE", 4);
    memcpy(h + 12, "fmt ", 4);   memcpy(h + 16, &fmt_size, 4);
    memcpy(h + 20, &fmt_pcm, 2); memcpy(h + 22, &ch, 2);
    memcpy(h + 24, &sr, 4);      memcpy(h + 28, &byte_rate, 4);
    memcpy(h + 32, &block_algn, 2); memcpy(h + 34, &bits, 2);
    memcpy(h + 36, "data", 4);   memcpy(h + 40, &data_bytes, 4);
    fwrite(h, 1, sizeof(h), f);
}
#endif

#if BIRDNET_LOG_AUDIO
/* Save one inference's 3 s chunk as a 24 kHz mono WAV so it can be played back
 * and correlated to its CSV row (via that row's "clip" column). */
static esp_err_t birdlog_wav_clip(const char *path, const int16_t *samples, uint32_t n)
{
    FILE *f = fopen(path, "wb");
    if (f == NULL) {
        return ESP_FAIL;
    }
    wav_write_header(f, n);
    size_t wrote = fwrite(samples, sizeof(int16_t), n, f);
    fclose(f);
    return (wrote == (size_t)n) ? ESP_OK : ESP_FAIL;
}
#endif

#if BIRDNET_LOG_TO_FILE
/* Append one diagnostic CSV row to BIRDNET_LOG_PATH on the SD card. Opened and
 * closed per row so a power cut (battery use outdoors) loses at most one line.
 * Columns: ms,level_db,mean,lowband,week,t1,t1s,t2,t2s,t3,t3s,a1,a1s,hit,vote,det,infer_ms,clip
 * (t* = RAW model top-3 class index:score; week = seasonal-prior week index
 * [0,47] or -1 if unknown; a1:a1s = the prior-ADJUSTED top-1 that drove the
 * hit/vote/det columns; -1 indices = inference skipped by the level gate;
 * infer_ms = model wall-clock time, 0 on gated rows; clip = saved WAV name when
 * BIRDNET_LOG_AUDIO is on, else empty). */
static void birdlog_row(float level_db, double mean, double lowband, int week,
                        int i0, float s0, int i1, float s1, int i2, float s2,
                        int a1, float a1s, int hit, int vote, int det,
                        float infer_ms, int clip_id)
{
    FILE *lf = fopen(BIRDNET_LOG_PATH, "a");
    if (lf == NULL) {
        return;
    }
    char clip[20];
    if (clip_id >= 0) {
        snprintf(clip, sizeof(clip), "clip%06d", clip_id);
    } else {
        clip[0] = '\0';
    }
    fprintf(lf, "%u,%.1f,%.4f,%.4f,%d,%d,%.3f,%d,%.3f,%d,%.3f,%d,%.3f,%d,%d,%d,%.1f,%s\n",
            (unsigned)esp_log_timestamp(), (double)level_db, mean, lowband, week,
            i0, (double)s0, i1, (double)s1, i2, (double)s2,
            a1, (double)a1s, hit, vote, det, (double)infer_ms, clip);
    fclose(lf);
}
#endif

#if BIRDNET_USE_PRIOR
/* Seasonal occurrence prior: multiply each class score by a soft, per-week
 * weight (1.0 at a species' seasonal peak, falling toward BIRDNET_PRIOR_FLOOR
 * out of season) and re-pick the top class into *res. scores[] is left RAW so
 * the diagnostic top-3 still mirrors the model directly. Returns the table week
 * index used [0,47], or -1 when the prior was not applied -- time unknown, or
 * the active model is not the 74-class set the table was built for (so the
 * indices would not line up). See birdnet_config.h for the formula + knobs. */
static int birdnet_apply_prior(const float *scores, int n, birdnet_result_t *res)
{
    static float s_prior_max[BIRDNET_PRIOR_CLASSES];
    static bool  s_prior_max_ready = false;

    if (n != BIRDNET_PRIOR_CLASSES) {
        return -1;   /* table is specific to the 74-class Plainfield model */
    }
    int week = birdnet_time_prior_week();
    if (week < 0) {
        return -1;   /* time not known yet -> leave detection unchanged */
    }

    if (!s_prior_max_ready) {
        /* Per-class annual peak, so the weight expresses each species' OWN
         * seasonality (when it is around) rather than how common it is. */
        for (int i = 0; i < BIRDNET_PRIOR_CLASSES; ++i) {
            float m = 0.0f;
            for (int w = 0; w < BIRDNET_PRIOR_WEEKS; ++w) {
                float p = BIRDNET_OCCURRENCE_PRIOR[w][i];
                if (p > m) m = p;
            }
            s_prior_max[i] = m;
        }
        s_prior_max_ready = true;
    }

    const float strength = BIRDNET_PRIOR_STRENGTH;
    const float floor_w  = BIRDNET_PRIOR_FLOOR;
    int   best_i = -1;
    float best_s = -1.0f;
    for (int i = 0; i < n; ++i) {
        float norm = (s_prior_max[i] > 1e-6f)
                     ? BIRDNET_OCCURRENCE_PRIOR[week][i] / s_prior_max[i]
                     : 1.0f;   /* no seasonal info -> stay neutral */
        float w = (1.0f - strength) + strength * (floor_w + (1.0f - floor_w) * norm);
        float adj = scores[i] * w;
        if (adj > best_s) {
            best_s = adj;
            best_i = i;
        }
    }
    res->top_index = best_i;
    res->top_score = best_s;
    return week;
}
#endif /* BIRDNET_USE_PRIOR */

static void infer_task(void *arg)
{
    (void)arg;
    int16_t *chunk   = (int16_t *)heap_caps_malloc(
        sizeof(int16_t) * BIRDNET_CHUNK_SAMPLES, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    float   *spectro = (float *)heap_caps_malloc(
        sizeof(float) * BIRDNET_MODEL_INPUT_LEN, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    static float scores[BIRDNET_NUM_CLASSES_MAX];
    assert(chunk && spectro);

    ESP_LOGI(TAG, "inference task started");

    /* Temporal voting state (see BIRDNET_DETECT_CONSECUTIVE): the candidate
     * species and how many back-to-back inferences it has cleared the score
     * threshold. A detection is only published once the count reaches the
     * required streak, which rejects one-off near-silence spikes. */
    int vote_index = -1;
    int vote_count = 0;

#if BIRDNET_LOG_TO_FILE
    {
        FILE *lf = fopen(BIRDNET_LOG_PATH, "a");
        if (lf != NULL) {
            fprintf(lf, "# session start ms=%u\n", (unsigned)esp_log_timestamp());
            fprintf(lf, "ms,level_db,mean,lowband,week,t1,t1s,t2,t2s,t3,t3s,a1,a1s,hit,vote,det,infer_ms,clip\n");
            fclose(lf);
            ESP_LOGI(TAG, "diagnostic file logging -> %s", BIRDNET_LOG_PATH);
        } else {
            ESP_LOGW(TAG, "could not open log file %s (SD mounted?)", BIRDNET_LOG_PATH);
        }
    }
#endif
#if BIRDNET_LOG_AUDIO
    /* Per-inference audio clips for offline correlation. Resume numbering after
     * any existing clips so sessions accumulate instead of overwriting. */
    mkdir(BIRDNET_LOG_AUDIO_DIR, 0777);   /* ignore EEXIST */
    uint32_t clip_seq = 0;
    for (;;) {
        char probe[64];
        struct stat st;
        snprintf(probe, sizeof(probe), "%s/clip%06u.wav",
                 BIRDNET_LOG_AUDIO_DIR, (unsigned)clip_seq);
        if (stat(probe, &st) != 0) {
            break;
        }
        ++clip_seq;
    }
    ESP_LOGI(TAG, "diagnostic audio clips -> %s/clipNNNNNN.wav (from %06u)",
             BIRDNET_LOG_AUDIO_DIR, (unsigned)clip_seq);
#endif

