haywoodsloan/esp32-s3-eye-birdnet/main/app_main.c
    for (;;) {
        xSemaphoreTake(s_infer_sem, portMAX_DELAY);

        /* Yield the core briefly so the CPU-1 IDLE task can run and feed the
         * task watchdog. A single inference on the full (alpha=1.0) model takes
         * several seconds -- longer than the BIRDNET_INFER_INTERVAL_MS trigger
         * cadence -- so the trigger semaphore is essentially always signalled
         * and this task would otherwise loop back-to-back with no gap, starving
         * IDLE1 and tripping the watchdog. This short sleep costs nothing next
         * to multi-second inference but guarantees the idle task gets a slice. */
        vTaskDelay(pdMS_TO_TICKS(20));

        /* Apply a requested model swap (SD read + interpreter rebuild). */
        int pending = model_registry_take_pending();
        if (pending >= 0) {
            model_registry_apply(pending);   /* logs the active model on success */
        }

        /* Snapshot the last 3 s in chronological order (oldest at s_ring_w).
         * The ring is contiguous in two spans (w..end, then 0..w), so copy each
         * with memcpy instead of a per-sample modulo across 72000 samples, and
         * keep the critical section to just the copy. */
        xSemaphoreTake(s_ring_mutex, portMAX_DELAY);
        uint32_t w = s_ring_w;
        uint32_t first = BIRDNET_CHUNK_SAMPLES - w;
        memcpy(chunk, &s_ring[w], first * sizeof(int16_t));
        if (w) {
            memcpy(chunk + first, s_ring, w * sizeof(int16_t));
        }
        xSemaphoreGive(s_ring_mutex);

        float sum_sq = 0.0f;
        for (uint32_t i = 0; i < BIRDNET_CHUNK_SAMPLES; ++i) {
            float f = (float)chunk[i] / 32768.0f;
            sum_sq += f * f;
        }

        /* Level gate: skip inference when the 3 s chunk is below the meter's
         * "usable" floor (BIRDNET_LEVEL_DB_QUIET, the grey->green boundary).
         * The model self-normalizes, so on near-silence it would otherwise
         * classify room noise and emit confident false positives. Keeping this
         * aligned with the meter means "green = the detector is listening". */
        float chunk_rms = sqrtf(sum_sq / (float)BIRDNET_CHUNK_SAMPLES);
        float chunk_db = 20.0f * log10f(chunk_rms + 1e-6f);
        if (chunk_db < BIRDNET_LEVEL_DB_QUIET) {
            vote_index = -1;   /* silence breaks the detection streak */
            vote_count = 0;
#if BIRDNET_LOG_TO_FILE
            /* Log gated (too-quiet) frames too, so the analysis can tell
             * "no audio reached the model" from "model rejected the audio". */
            birdlog_row(chunk_db, 0.0, 0.0, -1, -1, 0.0f, -1, 0.0f, -1, 0.0f, -1, 0.0f, 0, 0, 0, 0.0f, -1);
#endif
            continue;   /* too quiet to analyze */
        }

        /* Model uses the 3 s block; the display has its own live path. */
        stft_frontend_process(chunk, spectro, NULL);

        birdnet_result_t res = { .top_index = -1, .top_score = 0.0f, .is_mock = true };
#if BIRDNET_DEBUG_SCORES || BIRDNET_LOG_TO_FILE
        const int64_t t_infer0 = esp_timer_get_time();
#endif
        if (birdnet_model_run(spectro, scores, &res) != ESP_OK) {
            continue;
        }
#if BIRDNET_DEBUG_SCORES || BIRDNET_LOG_TO_FILE
        /* Wall-clock time of the model inference (I/O copy + Invoke), to profile
         * how fast the model runs on this hardware. */
        const float infer_ms = (float)(esp_timer_get_time() - t_infer0) / 1000.0f;
#endif

        /* Seasonal occurrence prior: down-weight out-of-season species for the
         * current week + location, then re-pick the top class into res. Returns
         * -1 (res untouched) when the time is unknown or the prior is disabled,
         * so detection is unchanged until the clock is known. */
#if BIRDNET_USE_PRIOR
        const int prior_week = birdnet_apply_prior(scores, birdnet_num_labels, &res);
#else
        const int prior_week = -1;
#endif
        (void)prior_week;

#if BIRDNET_DEBUG_SCORES || BIRDNET_LOG_TO_FILE
        /* Diagnostic snapshot of this inference: overall spectrogram mean, the
         * low-band (DC..~420 Hz) mean, and the top-3 scoring classes. Shared by
         * the serial log (BIRDNET_DEBUG_SCORES) and the SD-card CSV log
         * (BIRDNET_LOG_TO_FILE). A healthy classifier shows the top class
         * varying with the audio and a clear margin; a stuck/near-equal top-1
         * points at preprocessing rather than the audio. */
        double smean = 0.0;
        for (int i = 0; i < BIRDNET_MODEL_INPUT_LEN; ++i) {
            smean += spectro[i];
        }
        smean /= (double)BIRDNET_MODEL_INPUT_LEN;
        double lowband = 0.0;
        for (int b = 0; b < 9; ++b) {
            for (int t = 0; t < BIRDNET_SPEC_WIDTH; ++t) {
                lowband += spectro[b * BIRDNET_SPEC_WIDTH + t];
            }
        }
        lowband /= (double)(9 * BIRDNET_SPEC_WIDTH);
        int b0 = -1, b1 = -1, b2 = -1;
        float v0 = -1e30f, v1 = -1e30f, v2 = -1e30f;
        for (int i = 0; i < birdnet_num_labels; ++i) {
            float v = scores[i];
            if (v > v0)      { b2 = b1; v2 = v1; b1 = b0; v1 = v0; b0 = i; v0 = v; }
            else if (v > v1) { b2 = b1; v2 = v1; b1 = i; v1 = v; }
            else if (v > v2) { b2 = i; v2 = v; }
        }
#endif
#if BIRDNET_DEBUG_SCORES
        ESP_LOGI(TAG, "spectro[mean=%.3f lowband=%.3f] top3: %d:%s=%.2f  %d:%s=%.2f  %d:%s=%.2f  infer=%.0fms  wk=%d adj=%s=%.2f",
                 (double)smean, lowband,
                 b0, birdnet_label_name(b0), (double)v0,
                 b1, birdnet_label_name(b1), (double)v1,
                 b2, birdnet_label_name(b2), (double)v2,
                 (double)infer_ms,
                 prior_week,
                 (res.top_index >= 0) ? birdnet_label_name(res.top_index) : "?",
                 (double)res.top_score);
#endif

        /* Per-frame candidate: the top class, but only when it clears the score
         * threshold. Random near-silence spikes (the residual class-0 "Cooper's
         * Hawk" attractor) cross the threshold on a single frame and fall back
         * below it on the next, so they never accumulate a streak; a real call
         * that persists across the overlapping 3 s windows does. */
        bool frame_hit = (res.top_index >= 0) &&
                         (res.top_score >= BIRDNET_DETECT_THRESHOLD);
        if (frame_hit && res.top_index == vote_index) {
            vote_count++;
        } else if (frame_hit) {
            vote_index = res.top_index;
            vote_count = 1;
        } else {
            vote_index = -1;
            vote_count = 0;
        }
        bool detected = (vote_count >= BIRDNET_DETECT_CONSECUTIVE);

#if BIRDNET_DEBUG_SCORES
        if (frame_hit && !detected) {
            ESP_LOGI(TAG, "candidate %s (%.0f%%) %d/%d -- waiting for confirmation",
                     birdnet_label_name(res.top_index),
                     (double)(res.top_score * 100.0f),
                     vote_count, BIRDNET_DETECT_CONSECUTIVE);
        }
#endif

#if BIRDNET_LOG_TO_FILE
        int clip_id = -1;
#if BIRDNET_LOG_AUDIO
        /* Save the exact 3 s chunk this inference scored, named to match the
         * CSV row's "clip" column. v0 is the top-1 score (0 floor = save all). */
        if (v0 >= BIRDNET_LOG_AUDIO_MIN_SCORE) {
            char wp[64];
            snprintf(wp, sizeof(wp), "%s/clip%06u.wav",
                     BIRDNET_LOG_AUDIO_DIR, (unsigned)clip_seq);
            if (birdlog_wav_clip(wp, chunk, BIRDNET_CHUNK_SAMPLES) == ESP_OK) {
                clip_id = (int)clip_seq;
                ++clip_seq;
            }
        }
#endif
        birdlog_row(chunk_db, smean, lowband, prior_week, b0, v0, b1, v1, b2, v2,
                    res.top_index, res.top_score, frame_hit ? 1 : 0, vote_count,
                    detected ? 1 : 0, infer_ms, clip_id);
#endif

        /* Detections go to the serial log AND drive the on-screen overlay. */
        if (detected) {
            ESP_LOGI(TAG, "%s%s  (%.0f%%)",
                     res.is_mock ? "[mock] " : "", birdnet_label_name(res.top_index),
                     (double)(res.top_score * 100.0f));

