haywoodsloan/esp32-s3-eye-birdnet/main/app_main.c
            /* Publish to the UI overlay. Names are captured here (this task
             * owns the labels table); seq is bumped last so the main loop
             * never reads a half-written name. */
            snprintf(s_det_name, sizeof(s_det_name), "%s",
                     birdnet_label_name(res.top_index));
            snprintf(s_det_sci, sizeof(s_det_sci), "%s",
                     birdnet_label_sci(res.top_index));
            s_det_score = res.top_score;
            s_det_seq++;
        }
    }
}

#if BIRDNET_DEMO_OVERLAY
/* ---- Demo: slideshow the detection overlay through every species -------- *
 * Publishes a synthetic detection for each label in the active table in turn,
 * so the detection card -- title, the SD-loaded species photo, and the
 * color-coded confidence bar -- can be verified end-to-end without the mic or
 * model. Confidence sweeps across the detect..1.0 range so the bar's red->green
 * gradient is exercised too. Drives the exact same publish path as a real
 * detection. Enabled by BIRDNET_DEMO_OVERLAY (see birdnet_config.h). */
static void demo_task(void *arg)
{
    (void)arg;
    ESP_LOGI(TAG, "DEMO overlay: cycling %d species every %d ms (mic + model idle)",
             birdnet_num_labels, BIRDNET_DEMO_OVERLAY_MS);
    int i = 0;
    for (;;) {
        int n = birdnet_num_labels;
        if (n > 0) {
            if (i >= n) i = 0;
            float frac = (n > 1) ? (float)i / (float)(n - 1) : 1.0f;
            s_det_score = BIRDNET_DETECT_THRESHOLD +
                          frac * (1.0f - BIRDNET_DETECT_THRESHOLD);
            snprintf(s_det_name, sizeof(s_det_name), "%s", birdnet_label_name(i));
            snprintf(s_det_sci,  sizeof(s_det_sci),  "%s", birdnet_label_sci(i));
            s_det_seq++;
            ESP_LOGI(TAG, "[demo] %d/%d %s (%s) %.0f%%", i + 1, n,
                     birdnet_label_name(i), birdnet_label_sci(i),
                     (double)(s_det_score * 100.0f));
            ++i;
        }
        vTaskDelay(pdMS_TO_TICKS(BIRDNET_DEMO_OVERLAY_MS));
    }
}
#endif

#if BIRDNET_RECORD_MODE
/* ---- Record mode: capture device audio to SD for training negatives -------
 * Writes BIRDNET_RECORD_CLIPS WAV clips of ~BIRDNET_RECORD_SECS seconds each to
 * <mount>/rec/devNNN.wav at the model's native 24 kHz mono. These device-domain
 * recordings (room tone, speech, HVAC -- captured through THIS microphone) are
 * added to the training "background" class and the model is fine-tuned, so it
 * stops defaulting to a bird on the device's own noise floor. The mic + model
 * are otherwise idle. Enabled by BIRDNET_RECORD_MODE (see birdnet_config.h). */

static void record_task(void *arg)
{
    (void)arg;
    /* Whole number of mic reads per clip, so every read is a full block (no
     * partial last block to special-case for the file or the display feed). */
    const uint32_t blocks =
        ((uint32_t)BIRDNET_RECORD_SECS * BIRDNET_SAMPLE_RATE_HZ +
         BIRDNET_READ_SAMPLES - 1) / BIRDNET_READ_SAMPLES;
    const uint32_t target = blocks * BIRDNET_READ_SAMPLES;
    static int16_t buf[BIRDNET_READ_SAMPLES];

    char dir[64];
    snprintf(dir, sizeof(dir), "%s/rec", BSP_SD_MOUNT_POINT);
    mkdir(dir, 0777);   /* ignore EEXIST: the dir may already exist */

    /* Resume numbering after any existing clips so repeat sessions (different
     * rooms/times across reflashes) ACCUMULATE instead of overwriting. Probe
     * dev000, dev001, ... and start at the first free index. */
    int start = 0;
    for (;;) {
        char probe[128];
        struct stat st;
        snprintf(probe, sizeof(probe), "%s/dev%03d.wav", dir, start);
        if (stat(probe, &st) != 0) {
            break;   /* first missing index -> next free slot */
        }
        ++start;
    }

    ESP_LOGW(TAG, "RECORD MODE: %d clips x ~%d s -> %s/devNNN.wav (24 kHz mono), "
             "continuing from dev%03d (existing clips kept)",
             BIRDNET_RECORD_CLIPS, BIRDNET_RECORD_SECS, dir, start);

    for (int k = 0; k < BIRDNET_RECORD_CLIPS; ++k) {
        const int c = start + k;
        char path[128];
        snprintf(path, sizeof(path), "%s/dev%03d.wav", dir, c);
        FILE *f = fopen(path, "wb");
        if (f == NULL) {
            ESP_LOGE(TAG, "cannot open %s for write (is the SD card present/writable?)", path);
            vTaskDelay(pdMS_TO_TICKS(1000));
            continue;
        }
        wav_write_header(f, target);

        for (uint32_t b = 0; b < blocks; ++b) {
            if (audio_capture_read(buf, BIRDNET_READ_SAMPLES) != ESP_OK) {
                vTaskDelay(pdMS_TO_TICKS(5));
                continue;
            }
            fwrite(buf, sizeof(int16_t), BIRDNET_READ_SAMPLES, f);

            /* Drive the meter + live spectrogram so the screen confirms capture
             * (mirrors the normal audio task's display feed). */
            double sum_sq = 0.0;
            for (int i = 0; i < BIRDNET_READ_SAMPLES; ++i) {
                float s = (float)buf[i] / 32768.0f;
                sum_sq += (double)s * (double)s;
            }
            s_level = sqrtf((float)(sum_sq / (double)BIRDNET_READ_SAMPLES));
            stft_display_push(buf, BIRDNET_READ_SAMPLES);
        }
        fclose(f);
        ESP_LOGW(TAG, "recorded %s  (%d/%d this session)", path, k + 1, BIRDNET_RECORD_CLIPS);
    }

    ESP_LOGW(TAG, "RECORD MODE complete: %d new clips in %s (now dev000..dev%03d) -- "
             "copy them off the SD card. Re-flash to record MORE (they accumulate), "
             "or set BIRDNET_RECORD_MODE back to 0 for normal detection.",
             BIRDNET_RECORD_CLIPS, dir, start + BIRDNET_RECORD_CLIPS - 1);
    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(1000));   /* idle until the user reflashes */
    }
}
#endif

/* ---- Model selection at boot: SD -> embedded -> mock -------------------- */
static void select_initial_model(void)
{
    if (model_registry_init() == ESP_OK && model_registry_count() > 0) {
        int def = model_registry_default_index();
        if (model_registry_apply(def) == ESP_OK) {
            if (model_registry_count() > 1) {
                setup_buttons();
            }
            ESP_LOGI(TAG, "using SD model '%s' (%d available)",
                     model_registry_active_name(), model_registry_count());
            return;
        }
        ESP_LOGW(TAG, "default SD model failed to load; falling back");
    }

