haywoodsloan/esp32-s3-eye-birdnet/main/app_main.c
#if BIRDNET_HAS_REAL_MODEL
    if (birdnet_model_set(birdnet_model_tflite, birdnet_model_tflite_len) == ESP_OK) {
        ESP_LOGI(TAG, "using embedded model");
        return;
    }
    ESP_LOGW(TAG, "embedded model failed to load; falling back to mock");
#endif

    ESP_LOGW(TAG, "no model available - MOCK classifier active");
}

void app_main(void)
{
    ESP_LOGI(TAG, "ESP32-S3-EYE BirdNET starting (stm32 DS-CNN, SD multi-model)");

#if BIRDNET_USE_PRIOR
    /* NVS backs the WiFi calibration store and persists the last known date for
     * the seasonal prior across reboots. Erase + retry on a layout change. */
    esp_err_t nvs_err = nvs_flash_init();
    if (nvs_err == ESP_ERR_NVS_NO_FREE_PAGES || nvs_err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        nvs_err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(nvs_err);
#endif

    s_ring_mutex  = xSemaphoreCreateMutex();
    s_infer_sem   = xSemaphoreCreateBinary();
    s_ring = (int16_t *)heap_caps_calloc(BIRDNET_CHUNK_SAMPLES, sizeof(int16_t),
                                         MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    assert(s_ring_mutex && s_infer_sem && s_ring);

    /* Display + UI. Pin the LVGL flush task to core 0 so panel rendering never
     * contends with audio capture + inference (both on core 1). Otherwise the
     * floating LVGL task can land on the compute core and stall mid-frame during
     * a 3 s inference, which shows as periodic stutter. This mirrors
     * bsp_display_start()'s default buffer config, changing only the affinity. */
    bsp_display_cfg_t disp_cfg = {
        .lvgl_port_cfg = ESP_LVGL_PORT_INIT_CONFIG(),
        .buffer_size   = BSP_LCD_H_RES * CONFIG_BSP_LCD_DRAW_BUF_HEIGHT,
        .double_buffer = CONFIG_BSP_LCD_DRAW_BUF_DOUBLE ? 1 : 0,
        .flags = {
            .buff_dma    = true,
            .buff_spiram = false,
            .sw_rotate   = false,
        },
    };
    disp_cfg.lvgl_port_cfg.task_affinity = 0;   /* pin LVGL flush to core 0 */
    bsp_display_start_with_config(&disp_cfg);
    bsp_display_backlight_on();
    bsp_display_lock(0);
    ESP_ERROR_CHECK(ui_init());
    bsp_display_unlock();

    /* DSP + classifier scaffolding (arena + op resolver; no model yet). */
    ESP_ERROR_CHECK(stft_frontend_init());
    ESP_ERROR_CHECK(stft_display_init());
    ESP_ERROR_CHECK(birdnet_model_init());
    birdnet_labels_reset_default();        /* labels for mock / fallback */

    /* Pick the model: SD manifest -> embedded -> mock. */
    select_initial_model();

#if BIRDNET_RECORD_MODE
    /* Record mode: capture device audio to the SD card (mounted above by the
     * model registry) as WAV negatives, instead of running detection. audio +
     * infer tasks are intentionally idle. */
    (void)audio_task;
    (void)infer_task;
    ESP_ERROR_CHECK(audio_capture_init());
    xTaskCreatePinnedToCore(record_task, "record", 6144, NULL, 6, NULL, 1);
#elif BIRDNET_DEMO_OVERLAY
    /* Demo mode: cycle the detection overlay through every species (each with
     * its SD photo) instead of running the mic + model, so the photo/overlay
     * path can be verified before testing real detections. audio_task and
     * infer_task are intentionally left idle here. */
    (void)audio_task;   /* defined but unused while demoing */
    (void)infer_task;
    xTaskCreatePinnedToCore(demo_task, "demo", 4096, NULL, 5, NULL, 1);
#else
    /* Audio last, so the first inference has a model + valid chunk forming. */
    ESP_ERROR_CHECK(audio_capture_init());

#if BIRDNET_USE_PRIOR
    /* Kick off WiFi + SNTP time sync in the background. Detection runs right
     * away regardless; the seasonal prior simply switches on once the week is
     * known (and stays off if no WiFi is configured). */
    birdnet_time_start();
#endif

    /* Core split: audio capture (prio 6) + inference (prio 5) on core 1; the UI
     * render loop (this task) + LVGL flush run on core 0. Audio outranks infer
     * so it is never delayed, and inference no longer steals time from the
     * display -> smooth scrolling even while a 3 s chunk is being classified. */
    xTaskCreatePinnedToCore(audio_task, "audio", 6144, NULL, 6, NULL, 1);
    xTaskCreatePinnedToCore(infer_task, "infer", 8192, NULL, 5, NULL, 1);
#endif

    /* UI snapshot scratch (main-loop owned; safe to pass to ui_update). */
    float *snap_display = (float *)heap_caps_malloc(sizeof(float) * DISP_LEN,
                                                    MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    assert(snap_display);

    for (;;) {
        ui_snapshot_t snap;
        /* Live scrolling spectrogram (its own lock; updated every mic read). */
        stft_display_copy(snap_display);
        snap.display = snap_display;
        snap.level   = s_level;

        /* Detection overlay event (ui tracks det_seq to fire once per bump). */
        snap.det_seq   = s_det_seq;
        snap.det_name  = s_det_name;
        snap.det_sci   = s_det_sci;
        snap.det_score = s_det_score;

        bsp_display_lock(0);
        ui_update(&snap);
        bsp_display_unlock();

        vTaskDelay(pdMS_TO_TICKS(BIRDNET_UI_FRAME_MS));
    }
}
